{
  "authors": [
    {
      "id": 1,
      "nombre": "Rick Riordan",
      "biografia": "Rick Riordan es un escritor estadounidense, conocido principalmente por sus series de libros de fantasia para jovenes. Nacio el 5 de junio de 1964 en San Antonio, Texas. Antes de dedicarse a la escritura, Riordan fue maestro de literatura y escritura en secundaria, lo que le permitio desarrollar un estilo accesible y entretenido para los jovenes lectores."
    },
    {
      "id": 2,
      "nombre": "Cassandra Clare",
      "biografia": "Cassandra Clare (nacida el 27 de julio de 1973 en Teheran, Iran) es una autora estadounidense, conocida principalmente por su serie de fantasia Cazadores de sombras (The Mortal Instruments). Crecio en diferentes partes del mundo debido al trabajo de sus padres, lo que le permitio tener una vision cosmopolita de la vida. Se traslado a los Estados Unidos a una edad temprana y mas tarde se mudo a Los Angeles, donde comenzo su carrera literaria."
    },
    {
      "nombre": "JK Rowling",
      "biografia": "JK Rowling es la autora de Harry Potter",
      "id": 3
    }
  ],
  "genres": [
    {
      "id": 1,
      "nombre": "Aventura"
    },
    {
      "id": 2,
      "nombre": "Accion"
    },
    {
      "id": 3,
      "nombre": "Novela"
    },
    {
      "id": 4,
      "nombre": "Comedia"
    },
    {
      "id": 5,
      "nombre": "Drama"
    },
    {
      "id": 6,
      "nombre": "Romance"
    },
    {
      "nombre": "Juvenil",
      "id": 7
    }
  ],
  "books": [
    {
      "id": 1,
      "titulo": "Percy Jackson y el ladron del rayo",
      "publicacion": 2005,
      "authorId": 1,
      "genreId": 1
    },
    {
      "id": 2,
      "titulo": "Percy Jackson y el mar de los monstruos",
      "publicacion": 2006,
      "authorId": 1,
      "genreId": 1
    },
    {
      "id": 3,
      "titulo": "Percy Jackson y la maldicion del titan",
      "publicacion": 2007,
      "authorId": 1,
      "genreId": 1
    },
    {
      "id": 4,
      "titulo": "Percy Jackson y la batalla del laberinto",
      "publicacion": 2008,
      "authorId": 1,
      "genreId": 1
    },
    {
      "id": 5,
      "titulo": "Percy Jackson y el Ultimo heroe del Olimpo",
      "publicacion": 2009,
      "authorId": 1,
      "genreId": 1
    },
    {
      "id": 6,
      "titulo": "Ciudad de hueso",
      "publicacion": 2007,
      "authorId": 2,
      "genreId": 6
    },
    {
      "id": 7,
      "titulo": "Ciudad de ceniza",
      "publicacion": 2008,
      "authorId": 2,
      "genreId": 6
    },
    {
      "id": 8,
      "titulo": "Ciudad de cristal",
      "publicacion": 2009,
      "authorId": 2,
      "genreId": 6
    },
    {
      "id": 9,
      "titulo": "Ciudad de los angeles caidos",
      "publicacion": 2011,
      "authorId": 2,
      "genreId": 6
    },
    {
      "id": 10,
      "titulo": "Ciudad de las almas perdidas",
      "publicacion": 2012,
      "authorId": 2,
      "genreId": 6
    },
    {
      "id": 11,
      "titulo": "Ciudad del fuego celestial",
      "publicacion": 2014,
      "authorId": 2,
      "genreId": 6
    },
    {
      "titulo": "Harry Potter y la Piedra Filosofal",
      "publicacion": 1998,
      "authorId": 3,
      "genreId": 7,
      "id": 12
    },
    {
      "titulo": "Harry Potter y la Cámara Secreta",
      "publicacion": 1998,
      "authorId": 3,
      "genreId": 7,
      "id": 13
    }
  ],
  "reviews": [
    {
      "id": 1,
      "texto": "Ciudad del fuego celestial (City of Heavenly Fire) es una conclusion epica y llena de emociones para la serie Cazadores de sombras: Los instrumentos mortales. Cassandra Clare logra un final satisfactorio, resolviendo grandes conflictos y brindando a los personajes un cierre adecuado a sus arcos narrativos, mientras mantiene el suspenso y las sorpresas hasta el ultimo momento. La batalla final contra el malvado Jonathan Morgenstern es impresionante, y las decisiones dificiles que enfrentan los protagonistas sumergen al lector en una montaña rusa emocional. El libro tambien profundiza en los temas de sacrificio, amor incondicional, y la lucha entre el bien y el mal, con un tono mas maduro que el de sus predecesores.",
      "calificacion": 10,
      "bookId": 11
    },
    {
      "id": 2,
      "texto": "Percy Jackson y el ladron del rayo es el primer libro de la exitosa serie Percy Jackson y los dioses del Olimpo de Rick Riordan. La historia sigue a Percy, un adolescente que descubre que es un semidios, hijo de Poseidon, el dios griego del mar. Tras ser acusado injustamente de robar el rayo de Zeus, Percy se embarca en una aventura junto con sus amigos Annabeth y Grover para encontrar el rayo perdido y evitar una guerra entre los dioses. A lo largo de su viaje, Percy se enfrenta a criaturas mitologicas, descubre secretos de su herencia y lucha con su propio destino.",
      "calificacion": 9,
      "bookId": 1
    }
  ]
}